#ifndef __CLIENT_H__
#define __CLIENT_H__

#include <netdb.h>
#include <unistd.h>
#include <sys/socket.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <memory.h>

/************************* 宏定义 *************************/

/************************* 常量定义 *************************/

const char* ipaddr = "127.0.0.1";
const int c_portnumber = 5000;
/************************* 参数宏定义 *************************/

/************************* 联合体定义 *************************/


/************************* 结构体定义 *************************/

/************************* 本地函数声明 *************************/


/************************* API函数声明 *************************/



#endif
